/*Задание 2.
Создайте число. Определите, является ли число трехзначным. Определите, является ли его
последняя цифра семеркой. Определите, является ли число четным.
*/
import java.util.Random;
class Task2 {
	public static void main(String... argv) {
int i = 999;
if ((i>99)&(i<1000))
				System.out.println("Число "+i+" является трёхзначным");
if (i/10)=0,7
				System.out.println("Число "+i+" оканчивается на 7");
if (i%2)=0
				System.out.println("Число "+i+" чётное");
else
	System.out.println("Warning: Несоответствие условию задачи");				
			}
}